# What is the employee satisfaction rate? & what variables contribute to said satisfaction?

In [ ]:
# download/upload possible needed packages to analyze the data

In [60]:
import pandas as pd
#from sklearn.linear_model import LinearRegression
#from sklearn.model_selection import train_test_split
#import matplotlib.pyplot as plt
#get_ipython().run_line_magic('matplotlib', 'inline')
#from sklearn import metrics
#import numpy as np
#from sklearn.model_selection import KFold
#from sklearn.model_selection import cross_val_score

In [6]:
# Import the dataset

In [61]:
EmployeeSatisfaction = pd.read_csv("../Data/Employee-Satisfaction-Index.csv")

In [62]:
EmployeeSatisfaction

,Unnamed: 0,emp_id,age,Dept,location,education,recruitment_type,job_level,rating,onsite,awards,certifications,salary,satisfied
0,0,HR8270,28,HR,Suburb,PG,Referral,5,2,0,1,0,86750,1
1,1,TECH1860,50,Technology,Suburb,PG,Walk-in,3,5,1,2,1,42419,0
2,2,TECH6390,43,Technology,Suburb,UG,Referral,4,1,0,2,0,65715,0
3,3,SAL6191,44,Sales,City,PG,On-Campus,2,3,1,0,0,29805,1
4,4,HR6734,33,HR,City,UG,Recruitment Agency,2,1,0,5,0,29805,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,495,HR5330,49,HR,Suburb,PG,On-Campus,2,5,0,6,0,29805,1
496,496,TECH9010,24,Technology,Suburb,UG,Referral,2,4,0,2,0,29805,0
497,497,MKT7801,34,Marketing,City,PG,On-Campus,1,3,0,2,0,24076,1
498,498,TECH5846,26,Technology,City,UG,On-Campus,2,1,1,1,1,29805,0
499,499,TECH7731,26,Technology,City,UG,Recruitment Agency,3,4,0,3,0,42419,0

In [9]:
# Begin data wrangling

In [10]:
# Remove unneccessary variables/columns

In [65]:
EmployeeSatisfaction.drop(["emp_id", "education", "recruitment_type", "awards", "certifications"], axis=1, inplace=True)

In [66]:
EmployeeSatisfaction

,Unnamed: 0,age,Dept,location,job_level,rating,onsite,salary,satisfied
0,0,28,HR,Suburb,5,2,0,86750,1
1,1,50,Technology,Suburb,3,5,1,42419,0
2,2,43,Technology,Suburb,4,1,0,65715,0
3,3,44,Sales,City,2,3,1,29805,1
4,4,33,HR,City,2,1,0,29805,1
...,...,...,...,...,...,...,...,...,...
495,495,49,HR,Suburb,2,5,0,29805,1
496,496,24,Technology,Suburb,2,4,0,29805,0
497,497,34,Marketing,City,1,3,0,24076,1
498,498,26,Technology,City,2,1,1,29805,0
499,499,26,Technology,City,3,4,0,42419,0

In [67]:
ES = EmployeeSatisfaction.iloc[:,1:]

In [82]:
ES.to_csv("../Data/ES.csv",index=False)

In [83]:
ES

     age  job_level  rating  onsite  salary  satisfied  DeptR  locationR
0     28          5       2       0   86750          1      0          0
1     50          3       5       1   42419          0      1          0
2     43          4       1       0   65715          0      1          0
3     44          2       3       1   29805          1      2          1
4     33          2       1       0   29805          1      0          1
..   ...        ...     ...     ...     ...        ...    ...        ...
495   49          2       5       0   29805          1      0          0
496   24          2       4       0   29805          0      1          0
497   34          1       3       0   24076          1      4          1
498   26          2       1       1   29805          0      1          1
499   26          3       4       0   42419          0      1          1

[500 rows x 8 columns]

In [15]:
# Recode both the Dept & location varible columns

In [69]:
ES['Dept'].value_counts()

Purchasing    109
HR            106
Technology     98
Marketing      95
Sales          92
Name: Dept, dtype: int64

In [47]:
ES['Dept'].unique()

array(['HR', 'Technology', 'Sales', 'Purchasing', 'Marketing'],
      dtype=object)

In [48]:
def recode_Dept(series):
    if series == 'HR':
        return 0
    elif series == 'Technology':
        return 1
    elif series == 'Sales':
        return 2
    elif series == 'Purchasing':
        return 3
    elif series == 'Marketing':
        return 4

In [73]:
ES['DeptR'] = ES['Dept'].apply(recode_Dept)

In [72]:
ES[['Dept', 'DeptR']]

           Dept  DeptR
0            HR      0
1    Technology      1
2    Technology      1
3         Sales      2
4            HR      0
..          ...    ...
495          HR      0
496  Technology      1
497   Marketing      4
498  Technology      1
499  Technology      1

[500 rows x 2 columns]

In [74]:
ES['location'].describe()

count      500
unique       2
top       City
freq       259
Name: location, dtype: object

In [75]:
ES['location'].unique()

array(['Suburb', 'City'], dtype=object)

In [53]:
def recode_location(series):
    if series == 'Suburb':
        return 0
    elif series == 'City':
        return 1

In [76]:
ES['locationR'] = ES['location'].apply(recode_location)

In [77]:
ES[['location', 'locationR']]

    location  locationR
0     Suburb          0
1     Suburb          0
2     Suburb          0
3       City          1
4       City          1
..       ...        ...
495   Suburb          0
496   Suburb          0
497     City          1
498     City          1
499     City          1

[500 rows x 2 columns]

In [78]:
ES

,age,Dept,location,job_level,rating,onsite,salary,satisfied,DeptR,locationR
0,28,HR,Suburb,5,2,0,86750,1,0,0
1,50,Technology,Suburb,3,5,1,42419,0,1,0
2,43,Technology,Suburb,4,1,0,65715,0,1,0
3,44,Sales,City,2,3,1,29805,1,2,1
4,33,HR,City,2,1,0,29805,1,0,1
...,...,...,...,...,...,...,...,...,...,...
495,49,HR,Suburb,2,5,0,29805,1,0,0
496,24,Technology,Suburb,2,4,0,29805,0,1,0
497,34,Marketing,City,1,3,0,24076,1,4,1
498,26,Technology,City,2,1,1,29805,0,1,1
499,26,Technology,City,3,4,0,42419,0,1,1

In [79]:
ES.drop(["Dept", "location"], axis=1, inplace=True)

In [80]:
ES

     age  job_level  rating  onsite  salary  satisfied  DeptR  locationR
0     28          5       2       0   86750          1      0          0
1     50          3       5       1   42419          0      1          0
2     43          4       1       0   65715          0      1          0
3     44          2       3       1   29805          1      2          1
4     33          2       1       0   29805          1      0          1
..   ...        ...     ...     ...     ...        ...    ...        ...
495   49          2       5       0   29805          1      0          0
496   24          2       4       0   29805          0      1          0
497   34          1       3       0   24076          1      4          1
498   26          2       1       1   29805          0      1          1
499   26          3       4       0   42419          0      1          1

[500 rows x 8 columns]

In [81]:
ES.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        500 non-null    int64
 1   job_level  500 non-null    int64
 2   rating     500 non-null    int64
 3   onsite     500 non-null    int64
 4   salary     500 non-null    int64
 5   satisfied  500 non-null    int64
 6   DeptR      500 non-null    int64
 7   locationR  500 non-null    int64
dtypes: int64(8)
memory usage: 31.4 KB